# FB -Post

In [1]:
%load_ext sql

In [2]:
%sql sqlite://

'Connected: @None'

## Prepare

Create Table

In [25]:
%%sql
DROP TABLE IF EXISTS user_actions;
CREATE TABLE user_actions (ds String,
                           user_id Integer,
                           post_id Integer,
                           action String,
                           extra String,
                          time_1 Integer,
                          time_2 Integer)

 * sqlite://
Done.
Done.

[]

Insert values

In [26]:
%%sql
DELETE FROM user_actions;
INSERT INTO user_actions VALUES
('2018-07-01', 1209283021, 329482048384792 , 'view', NULL,1,2),
('2018-07-01', 1209283021, 329482048384792 , 'like', NULL,1,2),
('2018-07-01', 1938409273, 349573908750923 , 'reaction', 'LOVE',1,3),
('2018-07-01', 1209283021, 329482048384792 , 'comment' , 'Such nice Raybans',1,3),
('2018-07-01', 1238472931, 329482048384792 , 'report', 'SPAM',1,4),
('2018-07-01', 1238712388, 328472938472087 , 'report', 'NUDITY',1,4),
('2018-07-01', 1238712388, 329482048384792 , 'reshare', 'I wanted to share with you all',1,5);

 * sqlite://
0 rows affected.
7 rows affected.

[]

In [48]:
%%sql
DROP TABLE IF EXISTS remove;
CREATE TABLE  remove (post_id Integer,
                          review_id Integer)

 * sqlite://
Done.
Done.

[]

Insert values

In [49]:
%%sql
DELETE FROM remove;
INSERT INTO remove VALUES
(329482048384792,1), (328472938472087,2)

 * sqlite://
0 rows affected.
2 rows affected.

[]

In [27]:
%%sql
select * from user_actions

 * sqlite://
Done.

[('2018-07-01', 1209283021, 329482048384792, 'view', None, 1, 2),
 ('2018-07-01', 1209283021, 329482048384792, 'like', None, 1, 2),
 ('2018-07-01', 1938409273, 349573908750923, 'reaction', 'LOVE', 1, 3),
 ('2018-07-01', 1209283021, 329482048384792, 'comment', 'Such nice Raybans', 1, 3),
 ('2018-07-01', 1238472931, 329482048384792, 'report', 'SPAM', 1, 4),
 ('2018-07-01', 1238712388, 328472938472087, 'report', 'NUDITY', 1, 4),
 ('2018-07-01', 1238712388, 329482048384792, 'reshare', 'I wanted to share with you all', 1, 5)]

## Run query

In [45]:
%%sql
SELECT extra as reason, COUNT(*) FROM user_actions 
WHERE action = 'report'
GROUP BY extra
ORDER BY COUNT(*) DESC
LIMIT 5

 * sqlite://
Done.

[('NUDITY', 1), ('SPAM', 1)]

In [81]:
%%sql
SELECT t1.user_id, t2.num_report * 1.00 / t1.num_record as p FROM

(select user_id, COUNT(*) as num_record FROM user_actions GROUP BY user_id) as t1
LEFT JOIN 
(select user_id, COUNT(*) as num_report FROM user_actions WHERE action = 'report' GROUP BY user_id) as t2
ON t1.user_id = t2.user_id

 * sqlite://
Done.

[(1209283021, None), (1238472931, 1.0), (1238712388, 0.5), (1938409273, None)]

In [82]:
%%sql
select sum(t1.num_unique_actions)*1.0/count(*) as avg_action from
(SELECT ds, user_id, COUNT(DISTINCT action) as num_unique_actions from
user_actions
GROUP BY user_id, ds) as t1

 * sqlite://
Done.

[(1.75,)]

In [83]:
%%sql
select time_2-time_1, count(*) as number_of_record from
user_actions
group by time_2-time_1

 * sqlite://
Done.

[(1, 2), (2, 2), (3, 2), (4, 1)]

In [84]:
%%sql
SELECT DATE('now', '-1 days')

 * sqlite://
Done.

[('2018-11-04',)]

In [85]:
%%sql
select 
count(*) * 1.0 / (select count(distinct post_id) from user_actions) from
(select DISTINCT user_actions.post_id as id_1, remove.post_id as id_2
FROM user_actions 
INNER JOIN remove
on user_actions.post_id = remove.post_id) as t1

 * sqlite://
Done.

[(0.6666666666666666,)]

In [117]:
%%sql
select a.post_id, count(*) from user_actions as a
LEFT JOIN
remove as b
on a.post_id - b.post_id >=-1000000000
where a.time_2=4 and b.review_id<3
GROUP BY a.post_id

 * sqlite://
Done.

[(328472938472087, 1), (329482048384792, 2)]

In [119]:
%%sql
select sum(case when extra is null then 1 else 0 end) from user_actions

 * sqlite://
Done.

[(2,)]

In [124]:
%%sql
select * from user_actions as a
INNER JOIN
remove as b
on a.post_id = b.post_id and b.review_id=1

 * sqlite://
Done.

[('2018-07-01', 1209283021, 329482048384792, 'comment', 'Such nice Raybans', 1, 3, 329482048384792, 1),
 ('2018-07-01', 1209283021, 329482048384792, 'like', None, 1, 2, 329482048384792, 1),
 ('2018-07-01', 1209283021, 329482048384792, 'view', None, 1, 2, 329482048384792, 1),
 ('2018-07-01', 1238472931, 329482048384792, 'report', 'SPAM', 1, 4, 329482048384792, 1),
 ('2018-07-01', 1238712388, 329482048384792, 'reshare', 'I wanted to share with you all', 1, 5, 329482048384792, 1)]

# Ads ROI

In [116]:
%%sql
DROP TABLE IF EXISTS tableA;
CREATE TABLE tableA (
    date STRING,
    adv_id STRING,
    ad_id STRING,
    spend INTEGER);
DROP TABLE IF EXISTS tableB;
CREATE TABLE tableB (
    date STRING,
    user_id STRING,
    ad_id STRING,
    user_spend INTEGER);

DELETE FROM tableA;
INSERT INTO tableA VALUES
('2018-07-01', '1','1',5),
('2018-07-01', '1','2',5),
('2018-07-01', '2','3',5),
('2018-07-01', '3','4',5);

DELETE FROM tableB;
INSERT INTO tableB VALUES
('2018-07-01', '11','1',2),
('2018-07-01', '11','2',2),
('2018-07-01', '22','3',2),
('2018-07-01', '33','3',2);

 * sqlite://
Done.
Done.
Done.
Done.
0 rows affected.
4 rows affected.
0 rows affected.
4 rows affected.

[]

***ROI for each ads(advertiser_id, ads_id, ROI)***

- Left Join
- Case when then when then else end

In [37]:
%%sql
select tableA.adv_id, tableA.ad_id, 
    sum(case when tableB.user_spend is null then 0 else tableB.user_spend end) * 1.0 / avg(tableA.spend) as roi
from tableA left join tableB on tableA.ad_id = tableB.ad_id
group by tableA.adv_id, tableA.ad_id

 * sqlite://
Done.

[(1, 1, 0.4), (1, 2, 0.4), (2, 3, 0.8), (3, 4, 0.0)]

***percentage of advertiser who has at least one conversion***

In [40]:
%%sql
select count (distinct adv_id) * 1.0 / (select count (distinct adv_id) from tableA) as p 
from tableA inner join tableB on tableA.ad_id = tableB.ad_id

 * sqlite://
Done.

[(0.6666666666666666,)]

# Song List

time|userid|songid| table2: userid1|userid2
问今天听的最频繁的歌曲是什么？寻找一个list有userid和friendid：两个朋友有多于两首共同听过的歌曲

In [44]:
%%sql
DROP TABLE IF EXISTS tableA;
CREATE TABLE tableA (
    date STRING,
    user_id STRING,
    song_id STRING);

DROP TABLE IF EXISTS tableB;
CREATE TABLE tableB (
   user_id1 STRING,
   user_id2 STRING);

DELETE FROM tableA;
INSERT INTO tableA VALUES
('2018-07-01', 'A','1'),
('2018-07-01', 'A','2'),
('2018-07-01', 'B','1'),
('2018-07-01', 'B','2'),
('2018-07-01', 'C','1'),
('2018-07-01', 'C','3');

DELETE FROM tableB;
INSERT INTO tableB VALUES
('A','B'),
('A','C'),
('B','C');

 * sqlite://
Done.
Done.
Done.
Done.
0 rows affected.
6 rows affected.
0 rows affected.
3 rows affected.

[]

In [48]:
%%sql
select tableA.user_id, tableB.user_id2, count(*) from tableA inner join tableB on tableA.user_id = tableB.user_id1
group by tableA.user_id, tableB.user_id2
having count(*) >=2

 * sqlite://
Done.

[('A', 'B', 2), ('A', 'C', 2), ('B', 'C', 2)]

- Friend list: swap order and union to get complete ordered pairs

In [63]:
%%sql
select * from 
(select user_id1, user_id2 from tableB
UNION
select user_id2 as user_id1, user_id1 as user_id2 from tableB) as all_all
left join tableA on all_all.user_id1 = tableA.user_id
limit 3

 * sqlite://
Done.

[('A', 'B', '2018-07-01', 'A', 1),
 ('A', 'B', '2018-07-01', 'A', 2),
 ('A', 'C', '2018-07-01', 'A', 1)]

# Last status

In [67]:
%%sql
DROP TABLE IF EXISTS tableA;
CREATE TABLE tableA(
    date STRING,
    time STRING,
    user_id STRING,
    action STRING);

DELETE FROM tableA;
INSERT INTO tableA VALUES
('2018-07-01', '12','1','on'),
('2018-07-01', '13','1','off'),
('2018-07-02', '11','1','off'),
('2018-07-02', '12','1','on'),
('2018-07-02', '13','2','off'),
('2018-07-02', '14','3','on');

 * sqlite://
Done.
Done.
0 rows affected.
6 rows affected.

[]

- Write max over subgroup without using window function

In [73]:
%%sql
select a.date, a.user_id, a.action
from tableA as a
left join tableA as b
on a.date = b.date and a.user_id = b.user_id and a.time < b.time
where b.time is null

 * sqlite://
Done.

[('2018-07-01', 1, 'off'),
 ('2018-07-02', 1, 'on'),
 ('2018-07-02', 2, 'off'),
 ('2018-07-02', 3, 'on')]

- Insert into table by select

In [78]:
%%sql
INSERT into tableA
select * from tableA;

select * from tableA limit 1;

 * sqlite://
13 rows affected.
Done.

[('2018-07-01', 12, 1, 'on')]

# Comment distribution

In [92]:
%%sql
DROP TABLE IF EXISTS tableA;
CREATE TABLE tableA(
    content_id STRING,
    content_type STRING,
    target_id STRING);

DELETE FROM tableA;
INSERT INTO tableA VALUES
('1','POST',NULL),
('2','COMMENT',1),
('3','COMMENT',1),
('4','POST',NULL),
('5','COMMENT',4),
('6','POST',NULL),
('7','POST',NULL)

 * sqlite://
Done.
Done.
0 rows affected.
7 rows affected.

[]

Note: `where a.content_type = 'POST'`

In [93]:
%%sql
select num_comments, count(*) as num_posts from
(   select a.content_id, sum(case when b.target_id is not null then 1 else 0 end) as num_comments
    from tableA as a
    left join tableA as b
    on b.content_type = 'COMMENT' and a.content_id = b.target_id
    where a.content_type = 'POST'
    group by a.content_id
) 
group by num_comments

 * sqlite://
Done.

[(0, 2), (1, 1), (2, 1)]

# Click Through Rate

In [98]:
%%sql
DROP TABLE IF EXISTS tableA;
CREATE TABLE tableA(
    user_id STRING,
    event STRING);

DELETE FROM tableA;
INSERT INTO tableA VALUES
('1','CLICK'),
('2','IMPRESSION'),
('3','CLICK'),
('4','IMPRESSION'),
('5','CLICK'),
('6','IMPRESSION');

 * sqlite://
Done.
Done.
0 rows affected.
6 rows affected.

[]

In [107]:
%%sql
select count(case when event = 'CLICK' then 1 else 0 end) as num_click,
count(*) as num_events from tableA

 * sqlite://
Done.

[(6, 6)]

# People Interaction

In [108]:
%%sql
DROP TABLE IF EXISTS tableA;
CREATE TABLE tableA(
    id_1 INTEGER,
    id_2 INTEGER);

DELETE FROM tableA;
INSERT INTO tableA VALUES
(1,3),
(1,4),
(2,3),
(2,5);

 * sqlite://
Done.
Done.
0 rows affected.
4 rows affected.

[]

Group by num of interactions

In [109]:
%%sql
select num_interactions, count(*) as freq from
(    select id_1 as id, count(*) as num_interactions from
        (select * from tableA
        UNION ALL
        select id_2 as id_1, id_1 as id_2 from tableA
        )
    group by id_1
)
group by num_interactions

 * sqlite://
Done.

[(1, 2), (2, 3)]